[Killed] MethodCallRemoval
Domain/Bank.php:20:9
     public static function create(Currency $from, Currency $to, float $rate): Bank
     {
         $bank = new Bank([]);
-        $bank->addEchangeRate($from, $to, $rate);
+        
 
         return $bank;
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Por

[Killed] PublicVisibility
Domain/Bank.php:26:5
     }
 
 
-    public function addEchangeRate(Currency $from, Currency $to, float $changeRate): void
+    protected function addEchangeRate(Currency $from, Currency $to, float $changeRate) : void
     {
         $this->exchangeRates[($from . '->' . $to)] = $changeRate;
killedBy: Tests\MoneyProblem\BankTest::test_convert_with_different_exchange_rates_returns_different_floats
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_with_different_exchange_rates_returns_different_floats
Error: Call to protected method MoneyProblem\Domain\Bank::addEchangeRate() from scope Tests\MoneyProblem\BankTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:59

ERRORS!
Tests: 6, Assertions: 7, Errors: 1.

[Killed] ConcatOperandRemoval
Domain/Bank.php:28:9
 
     public function addEchangeRate(Currency $from, Currency $to, float $changeRate): void
     {
-        $this->exchangeRates[($from . '->' . $to)] = $changeRate;
+        $this->exchangeRates['->' . $to] = $changeRate;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Por

[Killed] Concat
Domain/Bank.php:28:9
 
     public function addEchangeRate(Currency $from, Currency $to, float $changeRate): void
     {
-        $this->exchangeRates[($from . '->' . $to)] = $changeRate;
+        $this->exchangeRates['->' . $from . $to] = $changeRate;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Por

[Killed] PublicVisibility
Domain/Bank.php:31:5
         $this->exchangeRates[($from . '->' . $to)] = $changeRate;
     }
 
-    public function convert(Money $money, Currency $to): float
+    protected function convert(Money $money, Currency $to) : float
     {
         if (!$this->canConvert($money->getCurrency(), $to)) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope MoneyProblem\Domain\Portfolio

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\

[Killed] Equal
Domain/Bank.php:37:9
             throw new MissingExchangeRateException($money->getCurrency(), $to);
         }
 
-        return $money->getCurrency() == $to
+        return $money->getCurrency() != $to ? $money->getAmount() : (new Money($money->getAmount() * $this->exchangeRates[$money->getCurrency() . '->' . $to], $to))->getAmount();
             ? $money->getAmount()
             : (new Money($money->getAmount() * $this->exchangeRates[($money->getCurrency() . '->' . $to)], $to))->getAmount();
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Undefined array key "USD->USD"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:29
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:27
C:\Users\chabr\O

[Killed] Concat
Domain/Bank.php:39:13
 
         return $money->getCurrency() == $to
             ? $money->getAmount()
-            : (new Money($money->getAmount() * $this->exchangeRates[($money->getCurrency() . '->' . $to)], $to))->getAmount();
+            return $money->getCurrency() == $to ? $money->getAmount() : (new Money($money->getAmount() * $this->exchangeRates['->' . $money->getCurrency() . $to], $to))->getAmount();
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Undefined array key "->EURUSD"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:29
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:27
C:\Users\chabr\O

[Killed] ConcatOperandRemoval
Domain/Bank.php:39:13
 
         return $money->getCurrency() == $to
             ? $money->getAmount()
-            : (new Money($money->getAmount() * $this->exchangeRates[($money->getCurrency() . '->' . $to)], $to))->getAmount();
+            return $money->getCurrency() == $to ? $money->getAmount() : (new Money($money->getAmount() * $this->exchangeRates['->' . $to], $to))->getAmount();
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Undefined array key "->USD"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:29
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:27
C:\Users\chabr\OneD

[Killed] Concat
Domain/Bank.php:44:9
 
     private function canConvert(Currency $from, Currency $to): bool
     {
-        return $from == $to || array_key_exists($from . '->' . $to, $this->exchangeRates);
+        return $from == $to || array_key_exists($from . $to . '->', $this->exchangeRates);
     }
 }
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Por

[Killed] Concat
Domain/Bank.php:44:9
 
     private function canConvert(Currency $from, Currency $to): bool
     {
-        return $from == $to || array_key_exists($from . '->' . $to, $this->exchangeRates);
+        return $from == $to || array_key_exists('->' . $from . $to, $this->exchangeRates);
     }
 }
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Por
