[Killed] Foreach_
Domain/Portfolio.php:26:9
     public function evaluate(Currency $currency, Bank $bank): float
     {
         $total = 0;
-        foreach ($this->monies as $from => $mount) {
-            $total += $bank->convert(new Money($mount, Currency::from($from)), $currency);
-        }
+        foreach (array() as $from => $mount) {
         return $total;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that 0.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Domain/Portfolio.php:27:13
     {
         $total = 0;
         foreach ($this->monies as $from => $mount) {
-            $total += $bank->convert(new Money($mount, Currency::from($from)), $currency);
+            $total -= $bank->convert(new Money($mount, Currency::from($from)), $currency);
         }
         return $total;
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that -17.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Domain/Portfolio.php:27:13
     {
         $total = 0;
         foreach ($this->monies as $from => $mount) {
-            $total += $bank->convert(new Money($mount, Currency::from($from)), $currency);
+            $total = $bank->convert(new Money($mount, Currency::from($from)), $currency);
         }
         return $total;
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that 12.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
