[Killed] PublicVisibility
Domain/Bank.php:17:5
         $this->exchangeRates = $exchangeRates;
     }
 
-    public static function create(Currency $from, Currency $to, float $rate): Bank
+    protected static function create(Currency $from, Currency $to, float $rate) : Bank
     {
         $bank = new Bank([]);
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::create() from scope Tests\MoneyProblem\BankTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Bank.php:23:5
         return $bank->addEchangeRate($from, $to, $rate);
     }
 
-    public function addEchangeRate(Currency $from, Currency $to, float $changeRate): Bank
+    protected function addEchangeRate(Currency $from, Currency $to, float $changeRate) : Bank
     {
         $exchangeRates = array_merge($this->exchangeRates, [($from . '->' . $to) => $changeRate]);
killedBy: Tests\MoneyProblem\BankTest::test_convert_with_different_exchange_rates_returns_different_floats
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_with_different_exchange_rates_returns_different_floats
Error: Call to protected method MoneyProblem\Domain\Bank::addEchangeRate() from scope Tests\MoneyProblem\BankTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:59

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Killed] Concat
Domain/Bank.php:25:9
 
     public function addEchangeRate(Currency $from, Currency $to, float $changeRate): Bank
     {
-        $exchangeRates = array_merge($this->exchangeRates, [($from . '->' . $to) => $changeRate]);
+        $exchangeRates = array_merge($this->exchangeRates, [$from . $to . '->' => $changeRate]);
 
         return new Bank($exchangeRates);
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!

[Killed] ConcatOperandRemoval
Domain/Bank.php:25:9
 
     public function addEchangeRate(Currency $from, Currency $to, float $changeRate): Bank
     {
-        $exchangeRates = array_merge($this->exchangeRates, [($from . '->' . $to) => $changeRate]);
+        $exchangeRates = array_merge($this->exchangeRates, [$from . '->' => $changeRate]);
 
         return new Bank($exchangeRates);
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!

[Killed] PublicVisibility
Domain/Bank.php:30:5
         return new Bank($exchangeRates);
     }
 
-    public function convert(Money $money, Currency $to): Money
+    protected function convert(Money $money, Currency $to) : Money
     {
         if (!$this->canConvert($money->getCurrency(), $to)) {
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope Tests\MoneyProblem\BankTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Domain/Bank.php:32:9
 
     public function convert(Money $money, Currency $to): Money
     {
-        if (!$this->canConvert($money->getCurrency(), $to)) {
+        if ($this->canConvert($money->getCurrency(), $to)) {
             throw new MissingExchangeRateException($money->getCurrency(), $to);
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!

[Killed] Throw_
Domain/Bank.php:33:13
     public function convert(Money $money, Currency $to): Money
     {
         if (!$this->canConvert($money->getCurrency(), $to)) {
-            throw new MissingExchangeRateException($money->getCurrency(), $to);
+            new MissingExchangeRateException($money->getCurrency(), $to);
         }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Undefined array key "EUR->KRW"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:29
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:47

ERRORS!
Tests: 3, Asse

[Killed] Equal
Domain/Bank.php:36:9
             throw new MissingExchangeRateException($money->getCurrency(), $to);
         }
 
-        return $money->getCurrency() == $to
+        return $money->getCurrency() != $to ? $money : new Money($money->getAmount() * $this->exchangeRates[$money->getCurrency() . '->' . $to], $to);
             ? $money
             : (new Money($money->getAmount() * $this->exchangeRates[($money->getCurrency() . '->' . $to)], $to));
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
     'currency' => MoneyProblem\Domain\Currency Object (
-        'value' => 'USD'

[Killed] Multiplication
Domain/Bank.php:38:13
 
         return $money->getCurrency() == $to
             ? $money
-            : (new Money($money->getAmount() * $this->exchangeRates[($money->getCurrency() . '->' . $to)], $to));
+            return $money->getCurrency() == $to ? $money : new Money($money->getAmount() / $this->exchangeRates[$money->getCurrency() . '->' . $to], $to);
     }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
     'currency' => MoneyProblem\Domain\Currency Object (...)
-    'mount' => 12

[Killed] Concat
Domain/Bank.php:38:13
 
         return $money->getCurrency() == $to
             ? $money
-            : (new Money($money->getAmount() * $this->exchangeRates[($money->getCurrency() . '->' . $to)], $to));
+            return $money->getCurrency() == $to ? $money : new Money($money->getAmount() * $this->exchangeRates[$money->getCurrency() . $to . '->'], $to);
     }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Undefined array key "EURUSD->"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:29
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors

[Killed] ConcatOperandRemoval
Domain/Bank.php:43:9
 
     private function canConvert(Currency $from, Currency $to): bool
     {
-        return $from == $to || array_key_exists($from . '->' . $to, $this->exchangeRates);
+        return $from == $to || array_key_exists($from . '->', $this->exchangeRates);
     }
 }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Exception\MissingExchangeRateException: EUR->USD

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!

[Killed] AssignmentEqual
Domain/Bank.php:43:9
 
     private function canConvert(Currency $from, Currency $to): bool
     {
-        return $from == $to || array_key_exists($from . '->' . $to, $this->exchangeRates);
+        return ($from = $to) || array_key_exists($from . '->' . $to, $this->exchangeRates);
     }
 }
killedBy: Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Undefined array key "EUR->KRW"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:29
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:47

ERRORS!
Tests: 3, Asse
