[Killed] LessThanNegotiation
Domain/Money.php:15:9
      */
     public function __construct(int $amount, Currency $currency)
     {
-        if ($amount < 0) {
+        if ($amount >= 0) {
             throw new \Exception('On ne peut pas ajouter un montant négatif');
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Exception: On ne peut pas ajouter un montant négatif

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Money.php:15
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:25

ERRORS!
Tests: 1

[Killed] LessThan
Domain/Money.php:15:9
      */
     public function __construct(int $amount, Currency $currency)
     {
-        if ($amount < 0) {
+        if ($amount <= 0) {
             throw new \Exception('On ne peut pas ajouter un montant négatif');
         }
killedBy: Tests\MoneyProblem\MoneyTest::test_mount_equals_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_mount_equals_zero
Exception: On ne peut pas ajouter un montant négatif

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Money.php:15
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:85

ERRORS!
Tests: 16, Assertions

[Killed] Throw_
Domain/Money.php:16:13
     public function __construct(int $amount, Currency $currency)
     {
         if ($amount < 0) {
-            throw new \Exception('On ne peut pas ajouter un montant négatif');
+            new \Exception('On ne peut pas ajouter un montant négatif');
         }
         $this->mount = $amount;
killedBy: Tests\MoneyProblem\MoneyTest::test_negative_mount
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_negative_mount
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 9, Assertions: 12, Failures: 1.

[Killed] PublicVisibility
Domain/Money.php:22:5
         $this->currency = $currency;
     }
 
-    public function times(int $multiply): Money
+    protected function times(int $multiply) : Money
     {
         return new Money($this->mount * $multiply, $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::test_multiply_returns_positive_number
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_multiply_returns_positive_number
Error: Call to protected method MoneyProblem\Domain\Money::times() from scope Tests\MoneyProblem\MoneyTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:21

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] Multiplication
Domain/Money.php:24:9
 
     public function times(int $multiply): Money
     {
-        return new Money($this->mount * $multiply, $this->currency);
+        return new Money($this->mount / $multiply, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::test_multiply_returns_positive_number
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_multiply_returns_positive_number
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
     'currency' => MoneyProblem\Domain\Currency Object (...)
-    'mount' => 20

[Killed] PublicVisibility
Domain/Money.php:27:5
         return new Money($this->mount * $multiply, $this->currency);
     }
 
-    public function add(Money $money): Money
+    protected function add(Money $money) : Money
     {
         if ($money->currency->getValue() !== $this->currency->getValue()) {
killedBy: Tests\MoneyProblem\MoneyTest::test_add
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add
Error: Call to protected method MoneyProblem\Domain\Money::add() from scope Tests\MoneyProblem\MoneyTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:63

ERRORS!
Tests: 7, Assertions: 9, Errors: 1.

[Killed] NotIdentical
Domain/Money.php:29:9
 
     public function add(Money $money): Money
     {
-        if ($money->currency->getValue() !== $this->currency->getValue()) {
+        if ($money->currency->getValue() === $this->currency->getValue()) {
             throw new \Exception('Une monnaie en ' . $money->currency .
                 ' ne peut pas être ajoutée à une monnaie en ' . $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::test_add
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add
Exception: Une monnaie en EUR ne peut pas être ajoutée à une monnaie en EUR

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Money.php:27
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:63

ERRORS!
Tests: 7, As

[Killed] Throw_
Domain/Money.php:30:13
     public function add(Money $money): Money
     {
         if ($money->currency->getValue() !== $this->currency->getValue()) {
-            throw new \Exception('Une monnaie en ' . $money->currency .
-                ' ne peut pas être ajoutée à une monnaie en ' . $this->currency);
+            new \Exception('Une monnaie en ' . $money->currency . ' ne peut pas être ajoutée à une monnaie en ' . $this->currency);currency);
         }
         return new Money($this->mount + $money->mount, $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::test_add_different_currency
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add_different_currency
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 8, Assertions: 11, Failures: 1.

[Survived] Concat
Domain/Money.php:30:13
     public function add(Money $money): Money
     {
         if ($money->currency->getValue() !== $this->currency->getValue()) {
-            throw new \Exception('Une monnaie en ' . $money->currency .
-                ' ne peut pas être ajoutée à une monnaie en ' . $this->currency);
+            throw new \Exception('Une monnaie en ' . $money->currency . $this->currency . ' ne peut pas être ajoutée à une monnaie en ');currency);
         }
         return new Money($this->mount + $money->mount, $this->currency);

[Killed] Plus
Domain/Money.php:33:9
             throw new \Exception('Une monnaie en ' . $money->currency .
                 ' ne peut pas être ajoutée à une monnaie en ' . $this->currency);
         }
-        return new Money($this->mount + $money->mount, $this->currency);
+        return new Money($this->mount - $money->mount, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::test_add
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
     'currency' => MoneyProblem\Domain\Currency Object (...)
-    'mount' => 12

[Killed] PublicVisibility
Domain/Money.php:39:5
     /**
      * @throws \Exception
      */
-    public function divide(int $divide): ?Money
+    protected function divide(int $divide) : ?Money
     {
         if ($divide < 0) {
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_zero
Failed asserting that exception of type "Error" matches expected exception "DivisionByZeroError". Message was: "Call to protected method MoneyProblem\Domain\Money::divide() from scope Tests\MoneyProblem\MoneyTest" at
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:39
.

[Killed] LessThan
Domain/Money.php:41:9
      */
     public function divide(int $divide): ?Money
     {
-        if ($divide < 0) {
+        if ($divide <= 0) {
             throw new \Exception('Division par un nombre négatif impossible');
         }
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_zero
Failed asserting that exception of type "Exception" matches expected exception "DivisionByZeroError". Message was: "Division par un nombre négatif impossible" at
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Money.php:37
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat

[Killed] LessThanNegotiation
Domain/Money.php:41:9
      */
     public function divide(int $divide): ?Money
     {
-        if ($divide < 0) {
+        if ($divide >= 0) {
             throw new \Exception('Division par un nombre négatif impossible');
         }
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_zero
Failed asserting that exception of type "Exception" matches expected exception "DivisionByZeroError". Message was: "Division par un nombre négatif impossible" at
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Money.php:37
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat

[Killed] Throw_
Domain/Money.php:42:13
     public function divide(int $divide): ?Money
     {
         if ($divide < 0) {
-            throw new \Exception('Division par un nombre négatif impossible');
+            new \Exception('Division par un nombre négatif impossible');
         }
         if ($divide === 0) {
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_negative_number
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_negative_number
Failed asserting that exception message 'On ne peut pas ajouter un montant négatif' contains 'Division par un nombre négatif impossible'.

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.

[Killed] Identical
Domain/Money.php:44:9
         if ($divide < 0) {
             throw new \Exception('Division par un nombre négatif impossible');
         }
-        if ($divide === 0) {
+        if ($divide !== 0) {
             throw new \DivisionByZeroError('Division par 0 impossible');
         }
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_zero
Failed asserting that exception message 'Division by zero' contains 'Division par 0 impossible'.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] DecrementInteger
Domain/Money.php:44:9
         if ($divide < 0) {
             throw new \Exception('Division par un nombre négatif impossible');
         }
-        if ($divide === 0) {
+        if ($divide === -1) {
             throw new \DivisionByZeroError('Division par 0 impossible');
         }
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_zero
Failed asserting that exception message 'Division by zero' contains 'Division par 0 impossible'.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] Throw_
Domain/Money.php:45:13
             throw new \Exception('Division par un nombre négatif impossible');
         }
         if ($divide === 0) {
-            throw new \DivisionByZeroError('Division par 0 impossible');
+            new \DivisionByZeroError('Division par 0 impossible');
         }
         return new Money($this->mount / $divide, $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_zero
Failed asserting that exception message 'Division by zero' contains 'Division par 0 impossible'.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] Division
Domain/Money.php:47:9
         if ($divide === 0) {
             throw new \DivisionByZeroError('Division par 0 impossible');
         }
-        return new Money($this->mount / $divide, $this->currency);
+        return new Money($this->mount * $divide, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_by_positive_number
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_by_positive_number
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
     'currency' => MoneyProblem\Domain\Currency Object (...)
-    'mount' => 5
