[Killed] PublicVisibility
Domain/MoneyCalculator.php:7:5
 
 class MoneyCalculator
 {
-    public static function add(float $amount, float $amount2): float
+    protected static function add(float $amount, float $amount2) : float
     {
         return $amount + $amount2;
killedBy: Tests\MoneyProblem\MoneyTest::test_add_returns_value
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add_returns_value
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::add() from scope Tests\MoneyProblem\MoneyTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:15

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/MoneyCalculator.php:12:5
         return $amount + $amount2;
     }
 
-    public static function times(float $amount, int $value): float
+    protected static function times(float $amount, int $value) : float
     {
         return $amount * $value;
killedBy: Tests\MoneyProblem\MoneyTest::test_multiply_returns_positive_number
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_multiply_returns_positive_number
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::times() from scope Tests\MoneyProblem\MoneyTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:25

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
Domain/MoneyCalculator.php:17:5
         return $amount * $value;
     }
 
-    public static function divide(float $amount, int $value): float
+    protected static function divide(float $amount, int $value) : float
     {
         return $amount / $value;
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_returns_float
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_returns_float
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::divide() from scope Tests\MoneyProblem\MoneyTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:30

ERRORS!
Tests: 3, Assertions: 3, Errors: 1.
