[Killed] PublicVisibility
Domain/Portfolio.php:11:5
 {
     private array $monies = [];
 
-    public function add(Money $money): void
+    protected function add(Money $money) : void
     {
         if (!key_exists($money->getCurrency()->getValue(), $this->monies)) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Error: Call to protected method MoneyProblem\Domain\Portfolio::add() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Domain/Portfolio.php:13:9
 
     public function add(Money $money): void
     {
-        if (!key_exists($money->getCurrency()->getValue(), $this->monies)) {
+        if (key_exists($money->getCurrency()->getValue(), $this->monies)) {
             $this->monies[$money->getCurrency()->getValue()] = 0;
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Undefined array key "USD"

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:14
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:17

ERRORS!
Tests:

[Killed] DecrementInteger
Domain/Portfolio.php:14:13
     public function add(Money $money): void
     {
         if (!key_exists($money->getCurrency()->getValue(), $this->monies)) {
-            $this->monies[$money->getCurrency()->getValue()] = 0;
+            $this->monies[$money->getCurrency()->getValue()] = -1;
         }
         $this->monies[$money->getCurrency()->getValue()] += $money->getAmount();
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that 14.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Domain/Portfolio.php:16:9
         if (!key_exists($money->getCurrency()->getValue(), $this->monies)) {
             $this->monies[$money->getCurrency()->getValue()] = 0;
         }
-        $this->monies[$money->getCurrency()->getValue()] += $money->getAmount();
+        $this->monies[$money->getCurrency()->getValue()] -= $money->getAmount();
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Exception: On ne peut pas ajouter un montant négatif

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Money.php:16
C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.p

[Survived] Assignment
Domain/Portfolio.php:16:9
         if (!key_exists($money->getCurrency()->getValue(), $this->monies)) {
             $this->monies[$money->getCurrency()->getValue()] = 0;
         }
-        $this->monies[$money->getCurrency()->getValue()] += $money->getAmount();
+        $this->monies[$money->getCurrency()->getValue()] = $money->getAmount();
     }
 

[Killed] PublicVisibility
Domain/Portfolio.php:23:5
      * @throws MissingExchangeRateException
      * @throws \Exception
      */
-    public function evaluate(Currency $currency, Bank $bank): float
+    protected function evaluate(Currency $currency, Bank $bank) : float
     {
         $total = 0;
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Error: Call to protected method MoneyProblem\Domain\Portfolio::evaluate() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] DecrementInteger
Domain/Portfolio.php:25:9
      */
     public function evaluate(Currency $currency, Bank $bank): float
     {
-        $total = 0;
+        $total = -1;
         foreach ($this->monies as $from => $mount) {
             $total += $bank->convert(new Money($mount, Currency::from($from)), $currency)->getAmount();
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that 16.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Domain/Portfolio.php:26:9
     public function evaluate(Currency $currency, Bank $bank): float
     {
         $total = 0;
-        foreach ($this->monies as $from => $mount) {
-            $total += $bank->convert(new Money($mount, Currency::from($from)), $currency)->getAmount();
-        }
+        foreach (array() as $from => $mount) {
         return $total;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that 0.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Domain/Portfolio.php:27:13
     {
         $total = 0;
         foreach ($this->monies as $from => $mount) {
-            $total += $bank->convert(new Money($mount, Currency::from($from)), $currency)->getAmount();
+            $total = $bank->convert(new Money($mount, Currency::from($from)), $currency)->getAmount();
         }
         return $total;
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that 12.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Domain/Portfolio.php:27:13
     {
         $total = 0;
         foreach ($this->monies as $from => $mount) {
-            $total += $bank->convert(new Money($mount, Currency::from($from)), $currency)->getAmount();
+            $total -= $bank->convert(new Money($mount, Currency::from($from)), $currency)->getAmount();
         }
         return $total;
killedBy: Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_should_return_portfolio_in_usd_with_eur_and_usd
Failed asserting that -17.0 matches expected 17.

C:\Users\chabr\OneDrive\Documents\LP\Cours LP\Artisanat logiciel\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
